# 12. 데이터프레임 필터링과 변경

## 121~130

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)

In [4]:
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [5]:
df[df['현재가'] >=1500]

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [8]:
df[(df['현재가'] >=1500) & (df['현재가'] <1700)]

       종목명   현재가   등락률
종목코드
037730  3R  1510  7.36

In [9]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)

In [10]:
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [11]:
df['목표가'] = df['현재가']*1.1

In [18]:
df.drop('목표가', axis=1, inplace=True)

In [19]:
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28


종목코드	종목명	현재가	등락률
066570	LG전자	60000	3.84

In [21]:
df.loc["066570"] = ['LG전자','60000','3.84']

In [22]:
df

          종목명    현재가   등락률
종목코드
037730     3R   1510  7.36
036360  3SOFT   1790  1.65
005760   ACTS   1185  1.28
066570   LG전자  60000  3.84

In [23]:
df = pd.DataFrame(data = [[1, 2, 3], [4, 5, 6]], columns=["A", "B", "C"])

In [24]:
df

   A  B  C
0  1  2  3
1  4  5  6

In [32]:
df = pd.DataFrame(data = [[1, 2, 3], [4, 5, 6]], columns=["a", "b", "c"])

In [33]:
df

   a  b  c
0  1  2  3
1  4  5  6

In [34]:
df = pd.DataFrame(data = [[1, 2, 3], [4, 5, 6]], columns=["A", "B", "C"])

In [35]:
df

   A  B  C
0  1  2  3
1  4  5  6

In [38]:
df.rename(columns={'A' : 'a'})

   a  B  C
0  1  2  3
1  4  5  6

In [39]:
data = {"카카오": [np.nan, 221, 35], "NAVER": [52, 47, 3]}
index = [2019, 2020, 2021]
df = pd.DataFrame(data=data, index=index)

In [40]:
df

        카카오  NAVER
2019    NaN     52
2020  221.0     47
2021   35.0      3

In [41]:
df.index.name = 'year'
df.columns.name = 'company'

In [42]:
df

company    카카오  NAVER
year
2019       NaN     52
2020     221.0     47
2021      35.0      3

In [44]:
df.reindex(['NAVER', '카카오'],axis=1)

company  NAVER    카카오
year
2019        52    NaN
2020        47  221.0
2021         3   35.0

In [46]:
df.drop('NAVER', axis=1)

company    카카오
year
2019       NaN
2020     221.0
2021      35.0

In [47]:
df.drop(['NAVER', '카카오'], axis=1)

Empty DataFrame
Columns: []
Index: [2019, 2020, 2021]

## 131~140

In [66]:
from pandas import DataFrame
import numpy as np

data = [
    {"cd":"A060310", "nm":"3S", "close":"2,920"},
    {"cd":"A095570", "nm":"AJ네트웍스", "close":"6,250"},
    {"cd":"A006840", "nm":"AK홀딩스", "close":"29,700"},
    {"cd":"A054620", "nm":"APS홀딩스", "close":"19,400"}
]
df = DataFrame(data=data)

In [49]:
df

        cd      nm   close
0  A060310      3S   2,920
1  A095570  AJ네트웍스   6,250
2  A006840   AK홀딩스  29,700
3  A054620  APS홀딩스  19,400

In [52]:
df['cd']=df['cd'].str.replace('A','')

In [53]:
df

       cd      nm   close
0  060310      3S   2,920
1  095570  AJ네트웍스   6,250
2  006840   AK홀딩스  29,700
3  054620  APS홀딩스  19,400

In [54]:
df

       cd      nm   close
0  060310      3S   2,920
1  095570  AJ네트웍스   6,250
2  006840   AK홀딩스  29,700
3  054620  APS홀딩스  19,400

In [67]:
df

        cd      nm   close
0  A060310      3S   2,920
1  A095570  AJ네트웍스   6,250
2  A006840   AK홀딩스  29,700
3  A054620  APS홀딩스  19,400

In [68]:
df['cd']=df['cd'].str[1:]

In [69]:
df

       cd      nm   close
0  060310      3S   2,920
1  095570  AJ네트웍스   6,250
2  006840   AK홀딩스  29,700
3  054620  APS홀딩스  19,400

In [70]:
df['close']=df['close'].str.replace(',','').astype(np.int64)

In [71]:
df

       cd      nm  close
0  060310      3S   2920
1  095570  AJ네트웍스   6250
2  006840   AK홀딩스  29700
3  054620  APS홀딩스  19400

In [72]:
data = [
    [1, 2, 3],
    [np.nan, 5, 6],
    [7, np.nan, 9],
    [10, 11, np.nan]
]
df = pd.DataFrame(data)

In [73]:
df

      0     1    2
0   1.0   2.0  3.0
1   NaN   5.0  6.0
2   7.0   NaN  9.0
3  10.0  11.0  NaN

In [74]:
df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [81]:
data = [
    [1, 1, np.nan],
    [10, np.nan, 10],
    [2, 3, 4]
]
columns = ['col0', 'col1', 'col2']
df = pd.DataFrame(data, columns=columns)

In [82]:
df

   col0  col1  col2
0     1   1.0   NaN
1    10   NaN  10.0
2     2   3.0   4.0

In [80]:
df.dropna(subset='col2')

   col0  col1  col2
1    10   NaN  10.0
2     2   3.0   4.0

In [83]:
data = [
    [1, 1, np.nan],
    [10, np.nan, 10],
    [2, 3, 4]
]
columns = ['col0', 'col1', 'col2']
df = pd.DataFrame(data, columns=columns)

In [84]:
df

   col0  col1  col2
0     1   1.0   NaN
1    10   NaN  10.0
2     2   3.0   4.0

In [85]:
df.fillna(0)

   col0  col1  col2
0     1   1.0   0.0
1    10   0.0  10.0
2     2   3.0   4.0

In [86]:
data = [
    [1, 1, np.nan],
    [10, np.nan, 10],
    [2, 3, 4]
]
columns = ['col0', 'col1', 'col2']
df = pd.DataFrame(data, columns=columns)

In [87]:
df

   col0  col1  col2
0     1   1.0   NaN
1    10   NaN  10.0
2     2   3.0   4.0

In [88]:
df.fillna(method='ffill')

   col0  col1  col2
0     1   1.0   NaN
1    10   1.0  10.0
2     2   3.0   4.0

In [89]:
data = [
    [1, 1, np.nan],
    [10, np.nan, 10],
    [2, 3, 4]
]
columns = ['col0', 'col1', 'col2']
df = pd.DataFrame(data, columns=columns)

In [91]:
df

   col0  col1  col2
0     1   1.0   NaN
1    10   NaN  10.0
2     2   3.0   4.0

In [92]:
df.isna()

    col0   col1   col2
0  False  False   True
1  False   True  False
2  False  False  False

In [93]:
df.notna()

   col0   col1   col2
0  True   True  False
1  True  False   True
2  True   True   True

In [94]:
data = np.arange(9).reshape(3, 3)
df = pd.DataFrame(data)

In [95]:
df

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [98]:
df.replace(0, 100, inplace=True)

In [99]:
df

     0  1  2
0  100  1  2
1    3  4  5
2    6  7  8

In [100]:
data = {
    'fruit': ['apple', 'orange', 'orange', 'apple', 'apple', 'apple'],
    'weight': [1.5, 1.3, 3.7, 2.4, 1.7, 1.8]
}
df = pd.DataFrame(data)

In [101]:
df

    fruit  weight
0   apple     1.5
1  orange     1.3
2  orange     3.7
3   apple     2.4
4   apple     1.7
5   apple     1.8

In [103]:
df['fruit'].dtypes

dtype('O')

In [105]:
df['fruit'].astype('category')

0     apple
1    orange
2    orange
3     apple
4     apple
5     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [106]:
df

    fruit  weight
0   apple     1.5
1  orange     1.3
2  orange     3.7
3   apple     2.4
4   apple     1.7
5   apple     1.8

# 13. 데이터프레임 query와 filter

## 141~150

In [107]:
data = [
    {"cd":"A060310", "nm":"3S", "open":2920, "close":2800},
    {"cd":"A095570", "nm":"AJ네트웍스", "open":1920, "close":1900},
    {"cd":"A006840", "nm":"AK홀딩스", "open":2020, "close":2010},
    {"cd":"A054620", "nm":"APS홀딩스", "open":3120, "close":3200}
]
df = DataFrame(data=data)
df = df.set_index('cd')

In [108]:
df

             nm  open  close
cd
A060310      3S  2920   2800
A095570  AJ네트웍스  1920   1900
A006840   AK홀딩스  2020   2010
A054620  APS홀딩스  3120   3200

In [109]:
df[df['close']>df['open']]

             nm  open  close
cd
A054620  APS홀딩스  3120   3200

In [110]:
df[df['close']>= 3000]

             nm  open  close
cd
A054620  APS홀딩스  3120   3200

In [111]:
df[(df['open']>=2000) & (df['close'] >=df['open'])]

             nm  open  close
cd
A054620  APS홀딩스  3120   3200

In [112]:
df[df['nm'].str[0]=='A']

             nm  open  close
cd
A095570  AJ네트웍스  1920   1900
A006840   AK홀딩스  2020   2010
A054620  APS홀딩스  3120   3200

In [113]:
df[df['nm'].str.contains('홀딩스')]

             nm  open  close
cd
A006840   AK홀딩스  2020   2010
A054620  APS홀딩스  3120   3200

In [127]:
data = np.arange(6).reshape(2,3)

In [128]:
data

array([[0, 1, 2],
       [3, 4, 5]])

In [129]:
columns = ['col 0', 'col 1', 'col 2']

In [130]:
columns

['col 0', 'col 1', 'col 2']

In [131]:
df = DataFrame(data=data, columns=columns)

In [132]:
df

   col 0  col 1  col 2
0      0      1      2
1      3      4      5

In [133]:
df[df['col 0'] == 0]

   col 0  col 1  col 2
0      0      1      2

In [154]:
data = {
    "PER": [6.42, 17.63, 21.09, 13.93],
    "PBR": [1.10, 1.49, 2.06, 1.88],
    "DPS": [1416, 1716, 2994, 1755]
}
index = ["2019/12", "2020/12", "2021/12", "2022/12(E)"]
df = pd.DataFrame(data=data, index=index)

In [135]:
df

              PER   PBR   DPS
2019/12      6.42  1.10  1416
2020/12     17.63  1.49  1716
2021/12     21.09  2.06  2994
2022/12(E)  13.93  1.88  1755

In [137]:
df.filter(items= ['PER','PBR'])

              PER   PBR
2019/12      6.42  1.10
2020/12     17.63  1.49
2021/12     21.09  2.06
2022/12(E)  13.93  1.88

In [138]:
df.filter(regex="P.R", axis=1)

              PER   PBR
2019/12      6.42  1.10
2020/12     17.63  1.49
2021/12     21.09  2.06
2022/12(E)  13.93  1.88

In [139]:
df.filter(regex="12$", axis=0)

           PER   PBR   DPS
2019/12   6.42  1.10  1416
2020/12  17.63  1.49  1716
2021/12  21.09  2.06  2994

In [140]:
df.filter(like="2022", axis=0)

              PER   PBR   DPS
2022/12(E)  13.93  1.88  1755

In [160]:
df=df.reset_index()

In [164]:
df.rename({'index':'time'}, inplace=True, axis=1) #rename 쓸때 반드시 {} 써라! // inplace=True안하면 반영안됨// axis=1 or Columns=  둘중하난 써라~

In [165]:
df

         time    PER   PBR   DPS
0     2019/12   6.42  1.10  1416
1     2020/12  17.63  1.49  1716
2     2021/12  21.09  2.06  2994
3  2022/12(E)  13.93  1.88  1755